;;;; test.lisp

(in-package #:gnuplot)

(defparameter *test-tbl*
  '((0 0.0 0.0 0.0 5.0)
    (1 1.0 0.1 0.01 9.207355)
    (2 1.4142135 0.4 0.08 9.546487)
    (3 1.7320508 0.90000004 0.26999998 5.7056)
    (4 2.0 1.6 0.64 1.2159874)
    (5 2.236068 2.5 1.2499999 0.20537853)
    (6 2.4494898 3.6000001 2.1599998 3.6029224)
    (7 2.6457512 4.9 3.43 8.284933)
    (8 2.828427 6.4 5.12 9.946791)
    (9 3.0 8.1 7.2899995 7.0605927))
  "Содержит таблицу для построения тестовоых графиков")

(defparameter  *test-labes-list*
  '((0 "t_1" "s")
    (1 "S_1" "m")
    (2 "V_1" "m/s")
    (3 "A_1" "m/(s^2)")
    (4 "Y_1" "m/(s^3)"))
  "")

(defparameter  *test-hash-lables* (make-hash-table-lables *test-labes-list*)
 "Пример хеш таблицы, содержащей описания имен параметров
" )

;;;;(make-plot *test-tbl* *test-hash-lables* :x1y1 '(0 (2 3)) :x1y2 '(0 (1 4)))

*test-tbl*
*test-labes-list*
*test-hash-lables*
