;;;; test.lisp

(in-package #:gnuplot)

(defparameter *test-tbl*
  '((0 0.0 0.0 0.0 5.0)
    (1 1.0 0.1 0.01 9.207355)
    (2 1.4142135 0.4 0.08 9.546487)
    (3 1.7320508 0.90000004 0.26999998 5.7056)
    (4 2.0 1.6 0.64 1.2159874)
    (5 2.236068 2.5 1.2499999 0.20537853)
    (6 2.4494898 3.6000001 2.1599998 3.6029224)
    (7 2.6457512 4.9 3.43 8.284933)
    (8 2.828427 6.4 5.12 9.946791)
    (9 3.0 8.1 7.2899995 7.0605927))
  "Содержит таблицу для построения тестовых графиков.")

(defparameter  *test-labes-list*
  '((0 "t_1" "s")
    (1 "S_1" "m")
    (2 "V_1" "m/s")
    (3 "A_1" "m/(s^2)")
    (4 "Y_1" "m/(s^3)"))
  "Содержит тестовый набор меток.")

(defparameter  *test-hash-lables* (make-hash-table-lables *test-labes-list*)
 "Пример хеш таблицы, содержащей описания имен параметров." )

;;;;(make-plot *test-tbl* *test-hash-lables* :x1y1 '(0 (2 3)) :x1y2 '(0 (1 4)))

*test-tbl*
*test-labes-list*
*test-hash-lables*

(make-plot
 '((1 1 1 1 1 1)
   (2 4 4 4 4 4)
   (3 9 9 9 9 9)
   (4 16 16 16 16))
 (make-hash-table-lables
  '((0 "Q" "kW")
    (1 "t_1" "K")
    (2 "t_2" "K")
    (3 "t_3" "K")
    (4 "t_4" "K")
    (5 "t_5" "K")))
 :x1y1 '(0 (1 2 3 4 5))
 :stepen 2  
 )

(require :lst-arr)
(defparameter *pressure-r*
  (lst-arr:transpose
   '((25000	20000	15000	10000	9080	8540	5000	2500	0)
     (1.46      1.49	1.52	1.56	1.57	1.91	2.03	2.19	1.72)
     (2.11      2.14	2.18	2.22	2.24	2.14	2.19	2.23	2.42)
     (3.54      3.60	3.67	3.75	3.78	4.01	4.17	4.38	4.09)))
  "Относительные потери давления")

(setf *pressure-r*
      (mapcar
       #'(lambda (el)
	   (setf (first el) (/ (first el) 25000.0))
	   el)
       *pressure-r*))


(make-plot
 *pressure-r*
 (make-hash-table-lables
  '((0 "Ne" "kW")
    (1 "r_{diff-mtr}" "K")
    (2 "r_{mtr-ks-out}" "K")
    (3 "r_{ks}" "K")))
 :x1y1 '(0 (1 2 3 ))
 :stepen 2  
 )

#+name: data
| ГТД            |
| ЖТ             |
| КВД            |
| КО             |
| КС             |
| ООКС           |
| САУ            |
| a*ОТВ          |
| B              |
| GГТ            |
| G2             |
| G2.TRU         |
| L0             |
| M2             |
| p2             |
| p02            |
| p2.ГР.1…       |
| p2.ГР.3        |
| p2.ГР          |
| p02.ГР         |
| pВОСПЛ.И       |
| pВОСПЛ.А       |
| p2.МТР         |
| p02.МТР        |
| p3             |
| p03            |
| p3.ГР.1…       |
| p3.ГР.5        |
| p3.ГР          |
| p03.ГР         |
| pСМ.И.1…       |
| pСМ.И.6        |
| pСМ.А          |
| q              |
| qОТВ           |
| t02            |
| T02            |
| t03.1…         |
| t03.7          |
| T03.МАХ        |
| T03.РАСЧ       |
| ΔT             |
| ΔTРАСЧ         |
| ΔT/T02         |
| tГТ            |
| V2             |
| w2             |
| w2.TRU         |
| wОТВ           |
| N              |
| D              |
| X              |
| FГ             |
| FГЭ            |
| FЖ             |
| FЖЭ            |
| ΣFЖ(Х)         |
| FЖ.R           |
| Sd20v          |
| Sd20v.TRU      |
| r02.ГР-03.ГР   |
| r02.ГР-СМ      |
| rДИФФ-МТР      |
| rКС            |
| rМТР-КС        |
| α              |
| ρ2             |
| ρОТВ           |
| λ              |
| λОТВ           |
| ζ02.ГР-МТР.TRU |
| ζМТР-03.ГР     |
| ζTRU           |

#+BEGIN_SRC lisp :var data=data
  (mapcar #'list (sort (mapcar #'first data) #'string< :key #'string-downcase))

#+END_SRC

#+RESULTS:
| a*ОТВ          |
| B              |
| D              |
| FГ             |
| FГЭ            |
| FЖ             |
| FЖ.R           |
| FЖЭ            |
| G2             |
| G2.TRU         |
| GГТ            |
| L0             |
| M2             |
| N              |
| p02            |
| p02.ГР         |
| p02.МТР        |
| p03            |
| p03.ГР         |
| p2             |
| p2.ГР          |
| p2.ГР.1…       |
| p2.ГР.3        |
| p2.МТР         |
| p3             |
| p3.ГР          |
| p3.ГР.1…       |
| p3.ГР.5        |
| pВОСПЛ.А       |
| pВОСПЛ.И       |
| pСМ.А          |
| pСМ.И.1…       |
| pСМ.И.6        |
| q              |
| qОТВ           |
| r02.ГР-03.ГР   |
| r02.ГР-СМ      |
| rДИФФ-МТР      |
| rКС            |
| rМТР-КС        |
| Sd20v          |
| Sd20v.TRU      |
| t02            |
| T02            |
| t03.1…         |
| t03.7          |
| T03.МАХ        |
| T03.РАСЧ       |
| tГТ            |
| V2             |
| w2             |
| w2.TRU         |
| wОТВ           |
| X              |
| α              |
| ΔT             |
| ΔT/T02         |
| ΔTРАСЧ         |
| ζ02.ГР-МТР.TRU |
| ζTRU           |
| ζМТР-03.ГР     |
| λ              |
| λОТВ           |
| ρ2             |
| ρОТВ           |
| ΣFЖ(Х)         |
| ГТД            |
| ЖТ             |
| КВД            |
| КО             |
| КС             |
| ООКС           |
| САУ            |

